Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Functions which have no global declarations cannot directly modify global variables (eliminating one source of unintended side-effects).
ja: global宣言を持たない関数は、グローバル変数を直接変更することはできません（意図しない副作用の原因の1つを排除します）。

source: Functions which operate on individual controls have a parameter named Control which supports a few different ways to identify the control.
ja: 個々のコントロールを操作する機能には、コントロールというパラメータがあり、コントロールを識別するためのいくつかの異なる方法をサポートしています。

source: Functions which previously accepted On/Off or On/Off/Toggle (but not other strings) now require 1/0/-1 instead.
ja: これまでOn/OffやOn/Off/Toggle（他の文字列は不可）を受け付けていた機能では、代わりに1/0/-1が必要となります。

source: Functions which return strings.
ja: 文字列を返す関数。

source: Functions with a WinTitle parameter (with exceptions, such as WinClose's ahk_group mode) throw if the target window or control is not found.
ja: WinTitleパラメータを持つ関数（WinCloseのahk_groupモードなどの例外を除く）は、対象となるウィンドウまたはコントロールが見つからない場合にスローします。

source: Fundamentals
ja: 基礎

source: Furthermore, Critical does not prevent the function from doing something that might indirectly result in a call to itself, such as calling SendMessage or DllCall.
ja: さらに、Criticalは、SendMessageや DllCallを呼び出すなど、間接的に自分自身への呼び出しとなるようなことを関数が行うことを妨げるものではありません。

source: Furthermore, Min/MaxSize can be specified more than once to use the window's current size for one dimension and an explicit size for the other.
ja: さらに、Min/MaxSizeを複数回指定することで、一方の次元にウィンドウの現在のサイズを、他方の次元に明示的なサイズを使用することができます。

source: Furthermore, any changes the function makes to global settings (including the last-found window) will go into effect for the current thread.
ja: さらに、この関数がグローバル設定（最終発見ウィンドウを含む）に加えた変更は、現在のスレッドに適用されることになります。

source: Furthermore, the special variable A_BasePath contains the full path and name of the selected base file.
ja: さらに、特別な変数A_BasePathは、選択されたベースファイルのフルパスと名前を含んでいる。

source: Furthermore, this example shows how to find all matches in a string rather than stopping at the first match (similar to the g flag in JavaScript's RegEx).
ja: さらに、この例では、最初のマッチで停止するのではなく、文字列内のすべてのマッチを検索する方法を示しています（JavaScriptのRegExのgフラグに似ています）。

source: Future improvements might supersede the use of ByRef for these purposes.
ja: 将来の改良により、これらの目的でのByRefの使用に取って代わる可能性があります。

source: GENERIC_READ := 0x80000000 ; Open the file for reading rather than writing.
ja: GENERIC_READ := 0x80000000 ; 書き込みではなく、読み込みのためにファイルを開く。

source: GENERIC_WRITE := 0x40000000 ; Open the file for writing rather than reading.
ja: GENERIC_WRITE := 0x40000000 ; 読み出しではなく、書き込みのためにファイルを開く。

source: GNU GENERAL PUBLIC LICENSE
ja: GNU 一般公衆ライセンス

source: GUI Control Types
ja: GUIコントロール

source: GUI Control Types - Syntax & Usage | AutoHotkey v2
ja: GUIコントロール - 構文と使用法｜AutoHotkey v2

source: GUI control types are elements of interaction which can be added to a GUI window using Gui.Add.
ja: GUIコントロールタイプは、Gui.AddメソッドでGUIウィンドウに追加することができるインタラクションの要素です。

source: GUI control types are elements of interaction which can be added to a GUI window using the Gui object's Add method.
ja: GUIコントロールタイプは、GUIオブジェクトのAddメソッドを使用してGUIウィンドウに追加することができるインタラクションの要素です。

source: GUI's Owner option
ja: GUIのOwnerオプション

source: GUI's Owner option overrides additional styles
ja: GUIのOwnerオプションが追加スタイルを上書きする

source: GUID(sGUID) ; Converts a string to a binary GUID and returns it in a Buffer.
ja: GUID(sGUID) ; 文字列をバイナリGUIDに変換し、Bufferで返す。

source: Game Controller (Gamepad, Joystick, etc.)
ja: ゲームコントローラー（ゲームパッド、ジョイスティックなど）

source: Games
ja: ゲーム

source: Gaming
ja: ゲーミング

source: General
ja: 一般

source: General Buttons
ja: 一般的なボタン

source: General Conventions
ja: 一般的な慣習

source: General Keys
ja: 一般的なキー

source: General Math
ja: 数学全般

source: General Properties
ja: 一般特性

source: General Remarks
ja: 総論

source: General Troubleshooting
ja: 一般的なトラブルシューティング

source: General explanation of objects.
ja: オブジェクトの一般的な説明。

source: General explanation of various concepts utilised by AutoHotkey.
ja: AutoHotkeyで利用される様々な概念についての一般的な説明。

source: General options:
ja: 一般的なオプションです：

source: General:
ja: 一般：

source: Generally a property acts like a variable, but its value might be calculated on demand and not actually stored anywhere.
ja: 一般的にプロパティは変数のように動作しますが、その値は要求に応じて計算され、実際にはどこにも保存されないかもしれません。

source: Generally each new copy of an object's address should be treated as another reference to the object, so the script should call ObjAddRef when it gains a copy and ObjRelease immediately before losing one.
ja: 一般に、オブジェクトのアドレスの新しいコピーはそれぞれ、そのオブジェクトへの別の参照として扱われるべきです。したがって、スクリプトは、コピーを得たときにObjAddRefを呼び出し、コピーを失う直前にObjReleaseを呼び出す必要があります。

source: Generally in those cases, WheelLeft or WheelRight signals are sent repeatedly while the wheel is held to one side, to simulate continuous scrolling.
ja: 一般的には、ホイールを片側に寄せた状態でWheelLeftやWheelRightの信号を繰り返し送信し、連続スクロールを模擬します。

source: Generally it allows content to appear at the same physical size on systems with different display resolutions, or to at least be usable on very high-resolution displays.
ja: 一般的には、ディスプレイ解像度の異なるシステム上でも同じ物理的サイズでコンテンツを表示したり、少なくとも非常に高解像度のディスプレイでも使用できるようにする。

source: Generally it is a multiple of 120, but some mouse hardware/drivers may report wheel movement at a higher resolution.
ja: 一般的には120の倍数ですが、マウスのハードウェア/ドライバによっては、より高い解像度でホイールの動きを報告する場合があります。

source: Generally it is faster and more reliable to instead place the text on the clipboard and paste it.
ja: 一般的には、クリップボードにテキストを置き、それを貼り付ける方が、より速く、より確実です。

source: Generally you can "unstick" the key by physically pressing it.
ja: 一般的には、キーを物理的に押すことで「スティックを解除」することができます。

source: Generally, Set has the same meaning as an assignment, so it uses the same operator:
ja: 一般にSetは代入と同じ意味を持つので、同じ演算子を使います：

source: Generally, the slow mode should be used only if the target window cannot be uniquely identified by its title and fast-mode text.
ja: 一般に、低速モードは、ターゲットウィンドウがそのタイトルと高速モードテキストによって一意に識別できない場合にのみ使用されるべきである。

source: Generates a pseudo-random number.
ja: 擬似乱数を生成します。

source: Generates a random floating point number in the range 0.0 to 1.0 and stores it in fraction.
ja: 0.0～1.0 の範囲でランダムな浮動小数点数を生成し、fractionに格納します。

source: Generates a random integer in the range 0 to 9 and stores it in N.
ja: 0～9の範囲でランダムな整数を生成し、Nに格納します。

source: Generates a random integer in the range 1 to 10 and stores it in N.
ja: 1～10 の範囲でランダムな整数を生成し，Nに格納します。

source: Generates a simple beep.
ja: 単純なビープ音を発生させる。

source: Get or set a value or call a method of object x, where y is a literal name and z is an expression which evaluates to a name.
ja: オブジェクトxの値の取得、設定、メソッドの呼び出し。yはリテラル名、zは名前として評価される式。

source: Get or set the __Item property (or default property) of object x with the parameter y (or multiple parameters in place of y).
ja: オブジェクトxの__Itemプロパティ（またはデフォルトのプロパティ）を、パラメータy（またはyの代わりに複数のパラメータ）で取得または設定します。

source: Get the name and path of a process used to open a document.
ja: ドキュメントを開くために使用されるプロセスの名前とパスを取得します。

source: GetCapacity and SetCapacity were removed.
ja: GetCapacityとSetCapacityを削除しました。

source: GetKeyName - Syntax & Usage | AutoHotkey v2
ja: GetKeyName - 構文と使用法｜AutoHotkey v2

source: GetKeySC - Syntax & Usage | AutoHotkey v2
ja: GetKeySC - 構文と使用法｜AutoHotkey v2

source: GetKeyState - Syntax & Usage | AutoHotkey v2
ja: GetKeyState - 構文と使用法｜AutoHotkey v2

source: GetKeyVK - Syntax & Usage | AutoHotkey v2
ja: GetKeyVK - 構文と使用法｜AutoHotkey v2

source: GetMethod - Syntax & Usage | AutoHotkey v2
ja: GetMethod - 構文と使用法｜AutoHotkey v2

source: Getting started:
ja: はじめに：

source: Getting user input
ja: ユーザーの入力を得る

source: Give as much information as you can to educate us doorknobs at what you are trying to do.
ja: あなたが何をしようとしているのか、私たちドアノブを教育するために、できるだけ多くの情報を提供してください。

source: Give the script a new name.
ja: スクリプトに名前をつけてください。

source: Gives the clipboard entirely new contents.
ja: クリップボードの内容を一新します。

source: Global Code
ja: グローバルコード

source: Global Variables
ja: グローバル変数

source: Global code, or code in the global scope, is any executable code that is not inside a function or class definition.
ja: グローバルコード（グローバルスコープ内のコード）とは、関数やクラス定義の内部にない実行可能なコードのことです。

source: Global labels are not valid targets for a local goto.
ja: グローバルラベルは、ローカルゴトのターゲットとして有効ではありません。

source: Global variables
ja: グローバル変数

source: Global variables declared within the function are also listed as static variables (this is a side-effect of new implementation details, but is kept as it might be useful in scripts with many global variables).
ja: 関数内で宣言されたグローバル変数も静的変数としてリストアップされます（これは新しい実装の詳細による副作用ですが、多くのグローバル変数を持つスクリプトで役に立つかもしれないので残してあります）。

source: Global variables may be read, but not assigned.
ja: グローバル変数は読み込むことはできるが、代入することはできない。

source: Go and explore.... and share your experiences in the AutoHotkey Forum.
ja: そしてAutoHotkeyフォーラムであなたの経験を共有してください。

source: Go get some reward snacks then return to reading the rest of this tutorial.
ja: ご褒美のお菓子を買って、このチュートリアルの続きを読みに戻りましょう。

source: Go to entries starting with:
ja: 始まるエントリに移動します：

source: Go to entries starting with: E, I, M, S, W, #
ja: 始まるエントリに移動します：E、 I、 M、 S、 W、 #

source: Go to the AutoHotkey Homepage:
ja: AutoHotkeyホームページへ：

source: Go to the AutoHotkey Homepage: https://www.autohotkey.com/
ja: AutoHotkeyホームページへ：https://www.autohotkey.com/

source: Good candidates are virtual key codes which generally have no effect, such as vkE8, which Microsoft documents as "unassigned", or vkFF, which is reserved to mean "no mapping" (a key which has no function).
ja: 例えば、マイクロソフト社が「unassigned」と表記するvkE8や、「no mapping」（何の機能も持たないキー）という意味で予約されているvkFFなど、一般的に何の効果もない仮想キーコードが良い候補となります。

source: Gosub has been removed, and labels can no longer be used with functions such as SetTimer and Hotkey.
ja: Gosubが削除され、SetTimerや Hotkeyなどの機能でラベルが使用できなくなりました。

source: Goto - Syntax & Usage | AutoHotkey v2
ja: Goto - 構文と使用法｜AutoHotkey v2

source: Gray
ja: Gray（グレー）

source: Green
ja: Green（緑）

source: Greet ; Title is A_ScriptName
ja: Greet ; タイトルはA_ScriptName

source: Greet "Greeting" ; Title is "Greeting"
ja: Greet "Greeting" ; タイトルは「Greeting」です。

source: Group #1:
ja: グループ1：

source: Group #1: Buttons
ja: グループ1：ボタン

source: Group #2:
ja: グループ2：

source: Group #2: Icon
ja: グループ2：アイコン

source: Group #3:
ja: グループ3：

source: Group #3: Default Button
ja: グループ3：デフォルトボタン

source: Group #4:
ja: グループ4：

source: Group #4: Modality
ja: グループ4：モダリティ

source: Group #5:
ja: グループ5：

source: Group #5: Other Options
ja: グループ5：その他のオプション

source: Group names are not case sensitive.
ja: グループ名の大文字と小文字は区別されません。

source: Group names are not case-sensitive.
ja: グループ名の大文字と小文字は区別されません。

source: GroupActivate - Syntax & Usage | AutoHotkey v2
ja: GroupActivate - 構文と使用法｜AutoHotkey v2

source: GroupActivate sets ErrorLevel and GroupAdd's Label works differently
ja: GroupActivateでErrorLevelが設定され、GroupAddのLabelが動作するのは異なる

source: GroupAdd "AltTabWindow", "ahk_class #32771" ; Older, or with classic alt-tab enabled
ja: GroupAdd "AltTabWindow", "ahk_class #32771" ; オールド、またはクラシックなalt-tabを有効にした場合。

source: GroupAdd "MSIE", "ahk_class IEFrame" ; Add only Internet Explorer windows to this group.
ja: GroupAdd "MSIE", "ahk_class IEFrame" ; Internet Explorerのウィンドウだけをこのグループに追加します。

source: GroupAdd "mail", "- Message (" ; This is for already opened items
ja: Groupadd "mail", "- Message (" ; これは既に開封されたものが対象です。

source: GroupAdd "mail", "Message - Microsoft Word" ; This is for mails currently being composed
ja: GroupAdd "mail", "Message - Microsoft Word" ; これは現在作成中のメールのためのものです。

source: GroupAdd - Syntax & Usage | AutoHotkey v2
ja: GroupAdd - 構文と使用法｜AutoHotkey v2

source: GroupClose - Syntax & Usage | AutoHotkey v2
ja: GroupClose - 構文と使用法｜AutoHotkey v2

source: GroupDeactivate "MyFavoriteWindows" ; Visit non-favorite windows to clean up desktop.
ja: GroupDeactivate "MyFavoriteWindows" ; デスクトップをきれいにするために、お気に入りでないウィンドウを訪問します。

source: GroupDeactivate - Syntax & Usage | AutoHotkey v2
ja: GroupDeactivate - 構文と使用法｜AutoHotkey v2

source: GroupDeactivate causes the first window that does not match any of the group's window specifications to be activated.
ja: GroupDeactivateは、グループのウィンドウ仕様のいずれにも合致しない最初のウィンドウをアクティブにします。

source: GroupDeactivate selects windows in a manner similar to the Alt+Shift+Esc system hotkey.
ja: GroupDeactivateは、Alt+Shift+Escのシステムホットキーと同様の方法でウィンドウを選択します。

source: Guards one or more statements against runtime errors and values thrown by the Throw statement.
ja: Tryステートメントは、実行時エラーやThrowステートメントでスローされた値からステートメントを保護します

source: Guards one or more statements against runtime errors and values thrown by the throw statement.
ja: 実行時エラーやthrow文によって投げられる値に対して、1つまたは複数のステートメントをガードします。

source: Gui DPI Scaling
ja: GUI DPIスケーリング

source: Gui DPI Scaling and OS DPI Scaling.
ja: GUI DPIスケーリングとOS DPIスケーリング。

source: Gui Object
ja: Guiオブジェクト

source: Gui Object - Methods & Properties | AutoHotkey v2
ja: Guiオブジェクト - メソッドとプロパティ｜AutoHotkey v2

source: Gui objects can be created with Gui() and retrieved with GuiFromHwnd.
ja: GuiオブジェクトはGui()で作成し、GuiFromHwndで取得することができます。

source: Gui or OnMessage() appears anywhere in the script.
ja: GuiまたはOnMessage()がスクリプトのどこかに表示されます。

source: Gui sub-commands
ja: Guiサブコマンド

source: Gui, GuiControl and GuiControlGet were replaced with Gui() and Gui/GuiControl objects, which are generally more flexible, more consistent, and easier to use.
ja: Gui、GuiControl、GuiControlGetは、Gui()とGui/GuiControlオブジェクトに置き換えられ、一般により柔軟で一貫性があり、より使いやすくなりました。

source: Gui, GuiControl, GuiControlGet (see Gui)
ja: Gui、GuiControl、GuiControlGet（Guiの項参照）

source: GuiControl Object
ja: GuiControlオブジェクト

source: GuiControl Object - Methods & Properties | AutoHotkey v2
ja: GuiControlオブジェクト - メソッドとプロパティ｜AutoHotkey v2

source: GuiControlGet's empty sub-command had two modes:
ja: GuiControlGetの空サブコマンドには2つのモードがありました：

source: GuiControlGet's empty sub-command had two modes: the default mode, and text mode, where the fourth parameter was the word Text.
ja: GuiControlGetの空サブコマンドには2つのモードがありました：というデフォルトのモードと、4番目のパラメータがTextという単語であるテキストモードがあります。

source: GuiCtrlFromHwnd - Syntax & Usage | AutoHotkey v2
ja: GuiCtrlFromHwnd - 構文と使用法｜AutoHotkey v2

source: GuiFromHwnd - Syntax & Usage | AutoHotkey v2
ja: GuiFromHwnd - 構文と使用法｜AutoHotkey v2

source: Gui_DropFiles(thisGui, Ctrl, FileArray, *) ; Support drag & drop.
ja: Gui_DropFiles(thisGui, Ctrl, FileArray, *) ; ドラッグ＆ドロップに対応。

source: Gui_Size(thisGui, MinMax, Width, Height) ; Expand/Shrink ListView in response to the user's resizing.
ja: Gui_Size(thisGui, MinMax, Width, Height) ; ユーザーのサイズ変更に対応してListViewを拡大・縮小する。

source: HBITMAP:bitmap-handle
ja: HBITMAP:ビットマップハンドル

source: HICON:icon-handle
ja: HICON:アイコンハンドル

source: HRESULT is the default return type for ComCall.
ja: HRESULTは、ComCallのデフォルトの戻り値タイプです。

source: HTML Entities Encoding
ja: HTMLエンティティ・エンコーディング

source: HWNDs and styles are always returned as pure integers, not hexadecimal strings.
ja: HWNDやスタイルは、16進数の文字列ではなく、常に純粋な整数値として返されます。

source: Hand-held Remote Controls
ja: ハンドヘルドリモコン

source: Handle single-character end keys by character code instead of by keycode.
ja: 一文字の終了キーをキーコードではなく、文字コードで扱います。

source: Handling within a __Call meta-function.
ja: メタファンクション__Call内で処理します。

source: Has no effect if the Input is already in progress.
ja: 入力がすでに進行している場合は、効果がありません。

source: Has no effect if the Input is not in progress.
ja: 入力中でない場合は、効果がありません。

source: Has no effect if the key normally does not produce text.
ja: そのキーが通常テキストを生成しない場合、効果はありません。

source: HasBase - Syntax & Usage | AutoHotkey v2
ja: HasBase - 構文と使用法｜AutoHotkey v2

source: HasBase accepts both objects and primitive values.
ja: HasBaseは、オブジェクトとプリミティブな値の両方を受け入れます。

source: HasKey was renamed to Has.
ja: HasKeyはHasに名称変更されました。

source: HasMethod - Syntax & Usage | AutoHotkey v2
ja: HasMethod - 構文と使用法｜AutoHotkey v2

source: HasMethod has the same limitations as GetMethod.
ja: HasMethodは、GetMethodと同じ制限を受けます。

source: HasProp - Syntax & Usage | AutoHotkey v2
ja: HasProp - 構文と使用法｜AutoHotkey v2

source: Have the date come before the time (meaningful only when Format is blank).
ja: 日付が時間の前に来るようにする（Formatが空白のときのみ意味があります）。

source: Have the option of using the keyboard hook to implement hotkeys, which might be more responsive than other hotkey methods while the CPU is under load in a game.
ja: キーボードフックを使ってホットキーを実装するオプションがあり、ゲームでCPUに負荷がかかっているときに、他のホットキー方式よりも反応が良くなる可能性があります。

source: Have your easiest-to-reach hotkeys perform an action appropriate to the type of window you're working with.
ja: 作業中のウィンドウの種類に応じたアクションを、最も簡単にアクセスできるホットキーで実行できるようにします。

source: Hebrew
ja: ヘブライ

source: Height := -1 ; "Keep aspect ratio" seems best.
ja: Height := -1 ; 「アスペクト比を保つ」が一番良さそうです。

source: Height of a caption area, in pixels.
ja: キャプション領域の高さ（ピクセル単位）。

source: Height of a single-line menu bar, in pixels.
ja: 単一行メニューバーの高さ（ピクセル単位）。

source: Height of a small caption, in pixels.
ja: 小さなキャプションの高さ（ピクセル単位）。

source: Height of rectangle or ellipse.
ja: 矩形または楕円の高さ。

source: Height of the thumb box in a vertical scroll bar, in pixels.
ja: 縦スクロールバーのサムボックスの高さをピクセル単位で示す。

source: Height, in pixels.
ja: 高さをピクセル単位で指定します。

source: Help - Open the AutoHotkey offline help file.
ja: ヘルプ - AutoHotkeyオフラインヘルプファイルを開きます。

source: Help Settings
ja: ヘルプ設定

source: Help files (F1): Shows a menu containing help files and online documentation for v1 and v2, and any other CHM files found in the installation directory.
ja: Help files (F1)：v1とv2のヘルプファイルとオンライン・ドキュメント、およびインストール・ディレクトリにあるその他のCHMファイルを含むメニューを表示します。

source: Help us help you.
ja: ご協力ください。

source: Here are a few more samples:
ja: 以下はそのサンプルである：

source: Here are some examples.
ja: 以下はその例です。

source: Here are some examples of mouse wheel hotkeys:
ja: ここでは、マウスホイールのホットキーの例を紹介します：

source: Here are some more examples.
ja: 以下はその例である。

source: Here are some more notes:
ja: 以下はそのメモである：

source: Here are some of the keyboard shortcuts available in Winamp 2.x (may work in other versions too).
ja: 以下はWinamp 2.xで使用できるキーボードショートカットの一部です（他のバージョンでも使用できる場合があります）。

source: Here are some of the technical details of the optimization process (semi-compiling):
ja: 最適化プロセス（セミ・コンパイル）の技術的な詳細は以下の通りです：

source: Here are the four most common symbols:
ja: 以下は、最も一般的な4つのシンボルである：

source: Here is a list of common standard resource types and the extensions that trigger them by default.
ja: 以下は、一般的な標準リソースタイプと、それをデフォルトでトリガーするエクステンションのリストです。

source: Here is a simple example on how to ask the user a couple of questions and doing some stuff with what was entered:
ja: ここでは、ユーザーにいくつかの質問をし、入力された内容でいくつかのことを行う簡単な例を示します：

source: Here is a very basic script containing a hotkey which types text using the Send function when the hotkey is pressed:
ja: ここでは、ホットキーが押されたときにSend関数を使用してテキストを入力するホットキーを含む、非常に基本的なスクリプトを紹介します：

source: Here is a working example that demonstrates how to put icons into a ListView's rows:
ja: ここでは、ListViewの行にアイコンを配置する方法を示す動作例を示します：

source: Here is a working example:
ja: 以下はその例である：

source: Here is a working script that creates and displays a ListView containing a list of files in the user's "My Documents" folder:
ja: ここでは、ユーザーの「My Documents」フォルダ内のファイルのリストを含むListViewを作成し、表示するスクリプトを紹介します：

source: Here is a working script that creates and displays a simple hierarchy of items:
ja: ここでは、アイテムの単純な階層を作成して表示するスクリプトを紹介する：

source: Here is an example.
ja: 以下はその一例です。

source: Here is an example of a CSV line produced by MS Excel:
ja: ここでは、MS Excelで作成したCSVの行の例を示します：

source: Here is the complete list:
ja: 以下、全リストです：

source: Hex
ja: 十六進法

source: Hexadecimal digit:
ja: 16進数の数字：

source: Hexadecimal digit: Same as IsDigit except the characters A through F (uppercase or lowercase) are also allowed.
ja: 16進数の数字：A～Fの文字（大文字、小文字）も使用できる以外は、IsDigitと同じです。

source: Hexadecimal integers, such as 0x7B, 0x007B or -0x1.
ja: 0x7B、0x007B、-0x1などの16進数の整数値。

source: Hexadecimal numbers all start with the prefix 0x.
ja: 16進数はすべて接頭辞0xで始まります。

source: Hexadecimal numbers must use the 0x or 0X prefix, except where noted in the documentation.
ja: 16進数の場合は、ドキュメントに記載されている場合を除き、0xまたは0Xのプレフィックスを使用する必要があります。

source: Hidden or cloaked windows are skipped.
ja: 隠れているウィンドウ、隠されているウィンドウはスキップされます。

source: Hidden text elements are detected if DetectHiddenText is ON at the time that GroupActivate, GroupDeactivate, and GroupClose are used.
ja: GroupActivate、GroupDeactivate、GroupCloseを使用する際にDetectHiddenTextがONの場合、隠しテキスト要素を検出します。

source: Hidden text elements are detected if DetectHiddenText is ON.
ja: DetectHiddenTextがONの場合、隠しテキスト要素が検出されます。

source: Hidden text elements are detected if DetectHiddenText has been turned on.
ja: 隠しテキスト要素は、DetectHiddenTextがオンになっている場合に検出されます。

source: Hidden text is detected.
ja: 隠し文字が検出されます。

source: Hidden text is not detected.
ja: 隠しテキストは検出されません。

source: Hidden windows are always detected regardless of DetectHiddenWindows.
ja: 非表示ウィンドウは、DetectHiddenWindowsの設定にかかわらず常に検出されます。

source: Hidden windows are detected.
ja: 隠しウィンドウが検出されます。

source: Hidden windows are not detected unless DetectHiddenWindows has been turned on, even if WinTitle is a HWND or object.
ja: WinTitleがHWNDまたはオブジェクトであっても、DetectHiddenWindowsがオンになっていない限り、隠しウィンドウは検出されません。

source: Hidden windows are not detected unless DetectHiddenWindows has been turned on.
ja: DetectHiddenWindowsがオンになっていない限り、隠しウィンドウは検出されません。

source: Hidden windows are not detected, except by the WinShow function.
ja: 隠しウィンドウは、WinShow機能以外では検出されません。

source: Hidden windows are only detected if DetectHiddenWindows is turned on, except with WinShow, which always detects hidden windows.
ja: 隠しウィンドウはDetectHiddenWindowsがオンになっている場合のみ検出されるが、WinShowでは常に検出される。

source: Hidden windows can then be unhidden individually or all at once by selecting the corresponding item on the menu.
ja: 非表示にしたウィンドウは、メニューの対応する項目を選択することで、個別に、または一度に非表示を解除することができる。

source: Hidden windows cannot be detected.
ja: 隠しウィンドウは検出できません。

source: Hide code
ja: コードを隠す

source: Hide template:
ja: テンプレートを隠す：

source: Hide template: Adds the template name to a list of templates that will not be shown in the GUI.
ja: Hide template：GUIに表示されないテンプレートのリストにテンプレート名を追加します。

source: Hides a tooltip after a certain amount of time without having to use Sleep (which would stop the current thread).
ja: スリープ（現在のスレッドを停止させる）を使用せずに、一定時間後にツールチップを隠す。

source: Hides the drop-down list of a ComboBox control.
ja: コンボボックスコントロールのドロップダウンリストを非表示にします。

source: Hides the mouse cursor when you press Win+C.
ja: Win+Cを押したときに、マウスカーソルを隠す。

source: Hides the specified control.
ja: 指定されたコントロールを非表示にします。

source: Hides the specified window.
ja: 指定したウィンドウを非表示にします。

source: Hides the window and activates the one beneath it.
ja: ウィンドウを隠し、その下にあるウィンドウをアクティブにします。

source: Hides the window.
ja: ウィンドウを隠します。

source: High (or H)
ja: High（またはH）

source: High impact:
ja: 高いインパクトがある：

source: Hip Hip Hooray!
ja: ヒップ・ヒップ・万歳！

source: Historically, data was written beyond the value's length when dealing with binary data or structs; now, a Buffer object should be used instead.
ja: 歴史的には、バイナリデータや構造体を扱う場合、値の長さを超えてデータを書き込んでいましたが、現在では、代わりにBufferオブジェクトを使用する必要があります。

source: Hold Ctrl or Shift when the installer starts.
ja: インストーラーが起動したら、CtrlまたはShiftを押したままにしてください。

source: Hold down F1 to slow down the cursor.
ja: F1を押し続けると、カーソルが遅くなる。

source: Hold down Numpad0 and press Numpad1 to launch a hotkey (Numpad0 & Numpad1::); hold down CapsLock and press another key, or click a mouse button (CapsLock & RButton::).
ja: Numpad0を押しながらNumpad1を押すとホットキーが起動し（Numpad0 & Numpad1::）、CapsLockを押しながら他のキーを押すか、マウスボタンをクリックする（CapsLock & RButton::）．

source: Holding down a modifier such as Ctrl or Shift while typing the origin key will put that modifier into effect for the destination key.
ja: CtrlやShiftなどの修飾子を押しながら原点キーを入力すると、その修飾子が移動先のキーに有効になります。

source: Holds Alt down until {Alt up} is sent.
ja: {Alt up}が送信されるまでAltdownを保持します。

source: Holds Ctrl down until {Ctrl up} is sent.
ja: {Ctrl up}が送信されるまで、Ctrlを押したままにします。

source: Holds Shift down until {Shift up} is sent.
ja: {Shift up}が送信されるまで、Shiftを押したままにします。

source: Holds the left Win down until {LWin up} is sent
ja: {LWin up}が送信されるまで、左のWinを押したままにします

source: Holds the right Win down until {RWin up} is sent
ja: {RWin up}が送信されるまで、右のWinを下に保持する
